<details><summary>tf plan:</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
terraform relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/app/app/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/app/app

To view this run in a browser, visit:
https://app.terraform.io/app/wspieramprzyrode/app/runs/run-4zNSkXmQXGA4u629

Waiting for the plan to start...

Terraform v0.12.25
Configuring remote state backend...
Initializing Terraform configuration...
2020/06/03 14:03:39 [DEBUG] Using modified User-Agent: Terraform/0.12.25 TFC/d2824cfb1e
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

github_actions_secret.crowdin_api_token_github_repo_secret: Refreshing state... [id=app:CROWDIN_API_TOKEN]
github_actions_secret.crowdin_project_id_github_repo_secret: Refreshing state... [id=app:CROWDIN_PROJECT_ID]
cloudflare_zone.dns_zone: Refreshing state... [id=e7a0b3ef45073d63cf619df176888e35]
google_service_account.wpieramprzyrode_api_dev_service_account: Refreshing state... [id=projects/wspieramprzyrode/serviceAccounts/wpieramprzyrode-api-dev@wspieramprzyrode.iam.gserviceaccount.com]
google_firebase_project.firebase_project: Refreshing state... [id=projects/wspieramprzyrode]
digitalocean_project.do_project: Refreshing state... [id=568d81a9-8d61-484f-9d7f-f7bd5595ff51]
digitalocean_tag.project_tag: Refreshing state... [id=wspieramprzyrode]
digitalocean_tag.cluster_tag: Refreshing state... [id=wspieramprzyrode-k8s]
cloudflare_record.docs_dns_record: Refreshing state... [id=e450de5fcf6c56e2b3f6c725d3a3481d]
google_service_account_key.wpieramprzyrode_api_dev_key: Refreshing state... [id=projects/wspieramprzyrode/serviceAccounts/wpieramprzyrode-api-dev@wspieramprzyrode.iam.gserviceaccount.com/keys/c14c83c75568371142a9896742fac8ec9df9811f]
google_project_iam_binding.wspieramprzyrode_api_dev_role_datastore_binding: Refreshing state... [id=wspieramprzyrode/roles/datastore.user]
digitalocean_kubernetes_cluster.cluster: Refreshing state... [id=4af50299-1b3e-44ae-b59f-47179c879ecf]
google_firebase_project_location.firebase_location: Refreshing state... [id=projects/wspieramprzyrode]
google_firebase_web_app.firebase_app: Refreshing state... [id=projects/wspieramprzyrode/webApps/1:794988607175:web:6de72f938c675f8400b0e2]
github_actions_secret.kuberenetes_github_repo_secret: Refreshing state... [id=app:KUBE_CONFIG]
data.google_firebase_web_app_config.firebase_app: Refreshing state...
helm_release.cert-manager: Refreshing state... [id=cert-manager]
helm_release.metrics-server: Refreshing state... [id=metrics-server]
helm_release.external-dns: Refreshing state... [id=external-dns]
helm_release.ambassador: Refreshing state... [id=ambassador]
kubernetes_namespace.k8s_namespace_dev: Refreshing state... [id=dev]
helm_release.cluster-resources: Refreshing state... [id=cluster-common-resources]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_firebase_web_app_config.firebase_app will be read during apply
  # (config refers to values not yet known)
 <= data "google_firebase_web_app_config" "firebase_app"  {
      + api_key             = (known after apply)
      + auth_domain         = (known after apply)
      + database_url        = (known after apply)
      + id                  = (known after apply)
      + location_id         = (known after apply)
      + measurement_id      = (known after apply)
      + messaging_sender_id = (known after apply)
      + storage_bucket      = (known after apply)
      + web_app_id          = "1:794988607175:web:6de72f938c675f8400b0e2"
    }

  # google_firebase_web_app.firebase_app will be updated in-place
  ~ resource "google_firebase_web_app" "firebase_app" {
        app_id       = "1:794988607175:web:6de72f938c675f8400b0e2"
      ~ display_name = "WspierajPrzyrode" -> "WspieramPrzyrode"
        id           = "projects/wspieramprzyrode/webApps/1:794988607175:web:6de72f938c675f8400b0e2"
        name         = "projects/wspieramprzyrode/webApps/1:794988607175:web:6de72f938c675f8400b0e2"
        project      = "wspieramprzyrode"
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

</details>